Мюнцкабинент_30/src/Documents/Планирование/Планирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Планирование</name>
  <comment>План приобретения объектов в коллекцию</comment>
  <registerRecords>InformationRegister.Планирование</registerRecords>
  <attributes>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.Коллекции</types>
    </type>
  </attributes>
  <attributes>
    <name>Коллекционер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>ВидМонеты</name>
      <type>
        <types>CatalogRef.ВидыМонет</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Мюнцкабинент_30/src/Documents/Планирование/ManagerModule.bsl
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм, 
				"ПланированиеКоллекции", 
				"Планирование коллекции",
				ПечатьПланирования(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),
				,
				"Документ.Планирование.ПФ_Планирование");
	
КонецПроцедуры	

Функция ПечатьПланирования(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	ТД 										= Новый ТабличныйДокумент;
	ТД.ИмяПараметровПечати  				= "ДОКУМЕНТ_ПЛАНИРОВАНИЕ";
	
	Макет 									= УправлениеПечатью.ПолучитьМакет("Документ.Планирование.ПФ_Планирование"); 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Планирование.Ссылка КАК ДокументПланирования
		|ИЗ
		|	Документ.Планирование КАК Планирование
		|ГДЕ
		|	Планирование.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьМакета										= Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ДокументПланирования 		= Выборка.ДокументПланирования;
		//
		ТД.Вывести(ОбластьМакета);
		//
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПланированиеСписок.НомерСтроки КАК НомерСтроки,
		               |	ПланированиеСписок.ВидМонеты,
		               |	ПланированиеСписок.Цена
		               |ИЗ
		               |	Документ.Планирование.Список КАК ПланированиеСписок
		               |ГДЕ
		               |	ПланированиеСписок.Ссылка = &ДокументПланирование
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	НомерСтроки";
					   
		Запрос.УстановитьПараметр("ДокументПланирование", Выборка.ДокументПланирования);
		ВыборкаСтрок = Запрос.Выполнить().Выбрать();
		
		ОбластьМакета										= Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТД.Вывести(ОбластьМакета);
		
		Пока ВыборкаСтрок.Следующий() Цикл
			ОбластьМакета									= Макет.ПолучитьОбласть("Строка");
			ОбластьМакета.Параметры.Заполнить (ВыборкаСтрок);
			ТД.Вывести(ОбластьМакета);
		КонецЦикла;	
		
		ОбластьМакета										= Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.СуммаДокумента		 		= Выборка.ДокументПланирования.СуммаДокумента;
		ТД.Вывести(ОбластьМакета);
		
	КонецЦикла;
	//
	Возврат ТД
    //
КонецФункции
